/* new Date() ------------------------------------------------------------------------------------------*/

  const d = new Date();
  console.log(d);
  console.log(d.toLocaleString); //スッキリ書ける

/* ----------------------------------------------------------------------------------------------------------------------------------------------*/

/* 日時データから年や月、時間、分といった情報を取得する方法 ------------------------------------------------------------------------------------------*/

  const D = new Date();  //初期化
  console.log(D);
  console.log(D.toLocaleString()); //スッキリ書ける

  console.log(D.getFullYear());     //年
  console.log(D.getMonth());        //月 ・・・「実際の月-1」の数字が取得される
  console.log(D.getDate());         //日
  console.log(D.getHours());        //時
  console.log(D.getMinutes());      //分
  console.log(D.getSeconds());      //秒
  console.log(D.getMilliseconds()); //ミリ秒を0 ~ 999の数値で取得する
  console.log(D.getDay());          //曜日・・・「実際の曜日-1」の数字が取得される

/* ----------------------------------------------------------------------------------------------------------------------------------------------*/

/* 指定した日時からデータを作る方法 ------------------------------------------------------------------------------------------*/

  //2000年4月11日のデータ
  const date = new Date(2000, 3, 11);
  console.log(date.toLocaleString);  // 2000/4/11 0:00:00

/* ----------------------------------------------------------------------------------------------------------------------------------------------*/
