/* 4-3 ローディング中画面 (クラスの追加・削除) -------------------------------------------------------------*/
    //  要素.classList.add('クラス名')；

    const loading = document.querySelector('#loading');

    window.addEventListener('load', () => {
        //ローディングが終わった時の処理
        loading.classList.add('loaded');
    });


    // メモ -------------------------------------------------------
    要素.classList.add('クラス1', 'クラス2')      //クラスの追加
    要素.classList.remove('クラス1', 'クラス2')   //クラスの削除

/*  --------------------------------------------------------------------------------------------------*/


/* 4-4 ボタンをクリックしてダークモード () -------------------------------------------------------------*/
    const btn = document.querySelector('#btn');

    btn.addEventListener('click', () => {
        //クリックされた時の処理
        document.body.classList.toggle('dark-theme')
    });


    /* メモ
    add だとクリックされた1回のみ。　
    toggleだとbodyの要素を取得する為、追加と削除を交互に行う　
    */


/* 4-5  ------------------------------------------------------------------------------------------*/
