// (P) Ⅲ

/*
関数 --------------------------------------------------------------------------------------------
*/
    const hello = function () {
        console.log("こんにちは！");
        console.log("私の名前は○○です");
    }

    hello(); // こんにちは！ // 私の名前は○○です

/*
アロー関数 --------------------------------------------------------------------------------------------
*/
    const greet = () => {
        console.log("こんにちは！");
    }

    greet(); // こんにちは！

/*
引数 --------------------------------------------------------------------------------------------
*/
    // 関数の引数にnameを追加してください
    const Greet = (name) => {
        console.log(`こんにちは、${name}さん`);
    };

    Greet("ひつじ仙人"); // こんにちは、ひつじ仙人さん

/* ??? ----------------------------------------------------------------------------------------------------------------------------------------------*/

    // // 関数を用いて、1から100までの数字を出力してください。ただし、3の倍数の時は「3の倍数です」と出力してください。

    //     function printNumbers() {
    //         for (let number = 1; number <= 100; number++) {
    //             if (number % 3 === 0) {
    //                 console.log("3の倍数です");
    //             } else {
    //                 console.log(number);
    //             }
    //         }
    //     }

    //     printNumbers();

/* ----------------------------------------------------------------------------------------------------------------------------------------------*/



/* 関数編 ------------------------------------------------------------------------------------------*/
    {
        //関数宣言
        function myAlert() {
            alert('こんにちは');
        }
        //関数の呼び出し
        myAlert(); // こんにちは
    }

    {
        function message() {
            console.log(こんにちは);
        }
        message(); // こんにちは
    }

/* ----------------------------------------------------------------------------------------------------------------------------------------------*/
/* 引数 ------------------------------------------------------------------------------------------*/

    {
        function myAlert(greeting, myName) {
            alert(greeting);
            alert(`${myName} ${'です！'}`);
        }
        //関数の呼び出し
        myAlert(おはようございます); //おはようございます
        myAlert('こんばんは', 'sss'); // こんばんは sss です！
    }

    {
        function myAlert(greeting, myName) {
            alert(greeting);
            alert(`${myName} ${'です！'}`);
        }
        //関数の呼び出し
        myAlert(おはようございます); //おはようございます
        myAlert('こんばんは', 'sss'); // こんばんは sss です！
    }

    {
        function message(userName) {
            console.log(`こんにちは${userName}さん`);
        }
        message(sss); // こんにちはsssさん
        message(aaa)  // こんにちはaaaさん
    }

    {
        function calculation(number1, number2) {
            //console.log(`${number1}と${number2}`);
            const plus = number1 + number2;
            const minus = number1 - number2;
            console.log(`${number1}+${number2}=${plus}`);
            console.log(`${number1}-${number2}=${minus}`);

        }
        calculation(1, 3) // 1と3 // 1+3=4 // 1-3=-2
    }


/* ----------------------------------------------------------------------------------------------------------------------------------------------*/
/* 戻り値 ------------------------------------------------------------------------------------------*/

    {
        function myCalc(a, b) {
            return a + b;
        }

        myCalc(1, 2); // 3
    }

     {
        function plus(number1, number2) {
            return number1 + number2;
        }
        //plus(5, 8); // 13
        console.log(plus(5, 8)); // 13

        function minus(number1, number2) {
            return number1 - number2;
        }
        minus(10, 3); // 7
        minus(20, plus(5, 8)); // 7

    }


/* ----------------------------------------------------------------------------------------------------------------------------------------------*/
/* アロー関数 ------------------------------------------------------------------------------------------*/

    {
        const myAlert = () => {
            alert('こんにちは');
            alert('アロー関数');
        }

        myAlert();
    }

     {
        const myAlert = (message) => {
            alert(message);
        }

        myAlert('こんにちは');
    }

/* ----------------------------------------------------------------------------------------------------------------------------------------------*/
/* 定数・変数に関数を代入 ------------------------------------------------------------------------------------------*/

    const myFunc = function message(userName) {
        console.log(`${userName}が呼び出されました`);
    }
    myFunc(iii); // iiiが呼び出されました

    //無名関数
     const myFunc2 = function (userName) {
        console.log(`${userName}が呼び出されました`);
    }
    myFunc(eee); // eeeが呼び出されました

    //アロー関数
    const myFunc3 = (userName) => {
        console.log(`${userName}が呼び出されました`);
    }
    myFunc(ttt); // tttが呼び出されました

/* ----------------------------------------------------------------------------------------------------------------------------------------------*/
