/* 3-2 (変数, 定数)  ------------------------------------------------------------------------------------------*/

    // let answer = window.prompt('ヘルプを見ますか？');
    // console.log(answer);

    const answers = window.prompt('ヘルプを見ますか？');
    if (answers === 'yes') {
        window.alert('タップでジャンプ、障害物を避けます。')
    }

/* ----------------------------------------------------------------------------------------------------------------------------------------------*/

/* 3-3 (else, if)  ------------------------------------------------------------------------------------------*/

    const answers = window.prompt('ヘルプを見ますか？');
        if (answers === 'yes') {
            window.alert('タップでジャンプ、障害物を避けます。')
        } else if (answers === 'no') {
            window.alert('ゲーム起動中')
        } else {
            window.alert('yesかnoでお答えください')
        }


/* ----------------------------------------------------------------------------------------------------------------------------------------------*/


/* 3-4 (数当てゲーム)  -------------------------------------------------------------------------------------------------------------------------------*/

    //Math.floor・・・切り捨て   //parseInt(変換したい文字列)   //let 変数名;・・・先に変数の定義 (if文などで代入されるデータが変わる場合)

    const number = Math.floor(Math.random() * 6);
    const answer = parseInt(window.prompt('数当てゲーム。0~5の数字を入力してね'));

    let message;
    if (answer === number) {
        message = 'あたり！';
    } else if (answer < number) {
        message = '残念でした！もっと大きい';
    } else if (answer > number) {
        message = '残念でした！もっと小さい';
    } else {
        message = '0~5の数字を入力してね';
    }
    window.alert(message);

/* ----------------------------------------------------------------------------------------------------------------------------------------------*/


/* 3-5 (時間で異なるメッセージを表示する)  -------------------------------------------------------------------------------------------------------------------------------*/

    //new Date()・・・現在の時刻を取得する   //getHours()・・・ページを開いた「時」を24時間で取得して定数hourに代入

    const hour = new Date().getHours();

    if (hour >= 19 && hour < 21) {
        window.alert('お弁当30%OFF!')
    } else if (hour === 9 || hour === 15) {
        window.alert('お弁当1個買ったら1個おまけ')
    } else {
        window.alert('お弁当はいかがですか')
    }

/* ----------------------------------------------------------------------------------------------------------------------------------------------*/


/* 3-6 ( while文 (1枚、2枚、3枚 と出力する))  -------------------------------------------------------------------------------------------------------------------------------*/

    let i = 1
    while(i <= 10) {
        console.log(`${i}枚`);
        i = i + 1;
        // i += 1
    }

/* ----------------------------------------------------------------------------------------------------------------------------------------------*/


/* 3-7 (コンソールでモンスターを倒せ！)  -------------------------------------------------------------------------------------------------------------------------------*/

    let enemy = 100;
    let count = 0;
    window.alert('戦闘スタート');

    while(enemy > 0) {
        const attack = Math.floor(Math.random() * 30) +1;
        console.log(`モンスターに${attack}のダメージ`);
        enemy -= attack;
        count += 1;
    }
    console.log(`${count}回でモンスターを倒した!`);

/* ----------------------------------------------------------------------------------------------------------------------------------------------*/


/* 3-8 (税込価格を計算する)  -------------------------------------------------------------------------------------------------------------------------------*/

    function total (price) {
        const tax = 0.1;
        return price + price * tax;
    };
    console.log(`コーヒーメーカーの値段は${total(8000)}円の(税込)です。`);

    document.querySelector('#output').textContent = `コーヒーメーカーの値段は${total(8000)}円の(税込)です。`;
    document.querySelector('#output2').textContent = `コーヒーメーカーの値段は${total(200)}円の(税込)です。`;
    document.querySelector('#output3').textContent = `コーヒーメーカーの値段は${total(1000)}円の(税込)です。`;

/* ----------------------------------------------------------------------------------------------------------------------------------------------*/


/* 3-9 (FizzBuzz(算術演算子))  -------------------------------------------------------------------------------------------------------------------------------*/

    function fizzbuzz (num) {
        if (num % 3 === 0 && num % 5 === 0 ) {
            return 'fizzbuzz';
        } else if (num % 3 === 0) {
            return 'fizz';
        } else if (num % 5 === 0) {
            return 'buzz';
        } else {
            return num;
        }
    }
    // console.log(fizzbuzz(15)); //fizzbuzz
    // console.log(fizzbuzz(3));  //fizz
    // console.log(fizzbuzz(5));  //buzz
    // console.log(fizzbuzz(1));  //return num;


    let i = 1;
    while (i <= 30) {
        console.log(fizzbuzz(i));
        i += 1;
    }

/* ----------------------------------------------------------------------------------------------------------------------------------------------*/


/* 3-10(1) (項目をリスト化する(配列))  -------------------------------------------------------------------------------------------------------------------------------*/

    let todos = ['デザインカンプ作成', 'データ整理', '勉強会申込', '牛乳買う'];
    // console.log(todos[0]);  //デザインカンプ作成
    // console.log(todos[1]);  //データ整理
    // console.log(todos[2]);  //勉強会申込
    // console.log(todos[3]);  //牛乳買う

    // ch3-10
    for (let item of todos) {
        console.log(item);
    }

    //for文
    for (let i = 0; i < todos.length; i++) {
        console.log(todos[i]);
    }

    // forEach
    todos.forEach( (todo) => {
        console.log(todo);
    });

/* ----------------------------------------------------------------------------------------------------------------------------------------------*/
/* 3-10(2)  -------------------------------------------------------------------------------------------------------------------------------*/

    //for...of文
    //.pop()・・・配列の最後のデータを削除する    //.push(データ)・・・配列の最後のデータを追加する
    //.shift()・・・配列の最初にデータを削除する  //.unshift(データ1,データ2)・・・配列の最初にデータを追加する

    let todos = ['デザインカンプ作成', 'データ整理', '勉強会申込', '牛乳買う'];
    todos.push('歯医者に行く');

    for (let item of todos) {
        // console.log(item);
        const li = `<li>${item}</li>`;
        // console.log(li);
        document.querySelector('#list').insertAdjacentHTML("beforeend",li)
    }

/* ----------------------------------------------------------------------------------------------------------------------------------------------*/


/* 3-11 アイテムの価格と在庫を表示する (オブジェクト)  -------------------------------------------------------------------------------------------------------------------------------*/

    // for...in文

    let jsbook = {
        title: 'Javascript入門',
        price: 2500,
        stock: 3
    };
    console.log(jsbook);
    console.log(jsbook.title);
    console.log(jsbook['price']);

    jsbook.stock = 10;
    // jsbook['stock'] = 10;
    console.log(jsbook.stock);

/* ----------------------------------------------------------------------------------------------------------------------------------------------*/
/* 3-11 (2) (オブジェクト)  -------------------------------------------------------------------------------------------------------------------------------*/

    // for...in文

    let jsbook = {
        title: 'Javascript入門',
        price: 2500,
        stock: 3
    };

    // for (let p in jsbook) {
    //     console.log(p + '=' + jsbook[p]);
    // }

    document.querySelector('#title').textContent = jsbook.title;
    document.querySelector('#price').textContent = `${jsbook.price}円`;
    document.querySelector('#stock').textContent = jsbook.stock;

/* ----------------------------------------------------------------------------------------------------------------------------------------------*/
