/* タイマー機能を使ってみよう   ------------------------------------------------------------------------------------------*/

    //setInterval()・・・ 一定周期ごとに何らかの処理を繰り返し実行するもの  ・時計・スライドショー
    //setTimeout() ・・・ 一定時間後に一度だけ処理を実行してくれるもの     ・時間差メッセージ・リダイレクト

    setInterval(関数, 時間);
    setTimeout(関数, 時間);

/* ----------------------------------------------------------------------------------------------------------------------------------------------*/

/* 一定時間ごとに処理を繰り返し実行してくれるsetInterval()の使い方  ------------------------------------------------------------------------------------------*/

    //現在時刻が表示されて、そこから 1 秒ごとに処理が繰り返される処理

    console.log(new Date());       //最初に表示しておきたい場合
    setInterval( () => {
        console.log(new Date());
    }, 1000);

/* ----------------------------------------------------------------------------------------------------------------------------------------------*/

/* setInterval()で起動したタイマーを止めるための方法  ------------------------------------------------------------------------------------------*/

    //簡単なカウントダウンタイマー
    let count = 3;

    const intervalId = setInterval( () => {
        console.log(count);
        count--;
        if (count < 0) {
            clearInterval(intervalId);  //ID はこちらの返り値として取得
        }
    }, 1000);

/* ----------------------------------------------------------------------------------------------------------------------------------------------*/
